lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include <climits>

#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "TIC/Unframer.h"
#include "TicProcessingContext.h"
#include "PowerHistory.h"
#include "TicFrameParser.h"

//#define SIMULATE_POWER_VALUES_WITHOUT_TIC

extern "C" {
#include "main.h"
#include <stdio.h>
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
        BSP_LED_On(LED2);
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

typedef void(*FHalDelayRefreshFunc)(void* context);
typedef bool(*FHalDelayConditionFunc)(void* context);

/**
 * @brief Wait for a given delay in ms, while running a function in background. Stop waiting immediately if a condition becomes false
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param conditionCheck A function returning false to immediately stop the wait period before timer elapses
 * @param context A context pointer provided to toRunWhileWaiting and/or conditionCheck as argument
 * @param delay The delay to wait for (in ms)
 * 
 */
void waitDelayAndCondition(uint32_t delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, FHalDelayConditionFunc conditionCheck = nullptr, void* context = nullptr) {
    uint32_t tickstart = HAL_GetTick();
    uint32_t wait = delay;

    /* Add a freq to guarantee minimum wait */
    if (wait < HAL_MAX_DELAY) {
        wait += (uint32_t)(uwTickFreq);
    }

    while((HAL_GetTick() - tickstart) < wait && (conditionCheck != nullptr && conditionCheck(context))) { /* FIXME: add condition logic here */
        if (toRunWhileWaiting != nullptr) {
            toRunWhileWaiting(context);
        }
    }
}

/**
 * @brief Wait for a given delay in ms, while running a function in background
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param context A context pointer provided to toRunWhileWaiting as argument
 * @param delay The delay to wait for (in ms)
 * 
 */
void waitDelay(uint32_t delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, void* context = nullptr) {
    waitDelayAndCondition(delay, toRunWhileWaiting, nullptr, context);
}

void drawHistory(Stm32LcdDriver& lcd, uint16_t x, uint16_t y, uint16_t width, uint16_t height, const PowerHistory& history) {
    if (width == 0 || height == 0)
        return;
    
    uint16_t xright = x + width - 1;

    unsigned int nbHistoryEntries = width; /* Initially try to fill-in the full width of the area */

    PowerHistoryEntry powerMeasurements[nbHistoryEntries];
    history.getLastPower(nbHistoryEntries, powerMeasurements);
    if (nbHistoryEntries > width) {    /* Sanity, overflow , exclude oldest entries to fit on display */
        nbHistoryEntries = width;
    }

    uint16_t debugX = UINT16_MAX;
    uint16_t debugYtop = UINT16_MAX;
    uint16_t debugYbottom = UINT16_MAX;
    int debugMinPower = INT_MIN;
    int debugMaxPower = INT_MAX;
    int debugValue = INT_MIN;

    const int maxPower = 3000;
    const int minPower = -1500;
    uint16_t zeroSampleAbsoluteY = y;
    zeroSampleAbsoluteY += static_cast<uint16_t>(static_cast<unsigned long int>(maxPower) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
    for (unsigned int measurementAge = 0; measurementAge < nbHistoryEntries; measurementAge++) {
        uint16_t thisSampleAbsoluteX = xright - measurementAge;   /* First measurement sample is at the extreme right of the allocated area, next samples will be placed to the left */
        if (debugX == UINT16_MAX) debugX = thisSampleAbsoluteX;
        PowerHistoryEntry& thisSampleEntry = powerMeasurements[measurementAge];
        TicEvaluatedPower& thisSamplePower = thisSampleEntry.power;

        if (debugValue == INT_MIN) {
            if (nbHistoryEntries>0) {
                debugValue = thisSampleEntry.nbSamples;
            }
        }
        if (debugMinPower == INT_MIN && debugMaxPower == INT_MAX) {
            debugMinPower = thisSamplePower.minValue;
            debugMaxPower = thisSamplePower.maxValue;
            if (!thisSamplePower.isValid) {
                debugMinPower = 0;
                debugMaxPower = 0;
            }
        }

        if (thisSamplePower.isValid) {
            /* Review the code below */
            if (thisSamplePower.maxValue > 0) { /* Positive value, even if range, display the highest value of the range (worst case) */
                uint16_t thisSampleTopAbsoluteY = 0;
                uint16_t thisSampleBottomAbsoluteY = 0;
                uint16_t thisSampleRelativeY = 0;
                if (true || thisSamplePower.maxValue > 0) { /* Positive and exact power */
                    thisSampleRelativeY = (static_cast<unsigned long int>(thisSamplePower.maxValue) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY - thisSampleRelativeY;
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY;
                    if (debugYtop == UINT16_MAX) debugYtop = thisSampleTopAbsoluteY;
                    if (debugYbottom == UINT16_MAX) debugYbottom = thisSampleBottomAbsoluteY;
                    lcd.drawVerticalLine(thisSampleAbsoluteX, thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY-thisSampleTopAbsoluteY, Stm32LcdDriver::Red);
                }
                else if (thisSamplePower.maxValue < 0) { /* Negative and exact power */
                    thisSampleRelativeY = (static_cast<unsigned long int>(-thisSamplePower.maxValue) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY;
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY + thisSampleRelativeY;
                    if (debugYtop == UINT16_MAX) debugYtop = thisSampleTopAbsoluteY;
                    if (debugYbottom == UINT16_MAX) debugYbottom = thisSampleBottomAbsoluteY;
                    lcd.drawVerticalLine(thisSampleAbsoluteX, thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY-thisSampleTopAbsoluteY, Stm32LcdDriver::DarkGreen);
                }
            }
            else {  /* Max value is negative, we are injecting, display the range */
                uint16_t thisSampleMaxRelativeY = 0;
                uint16_t thisSampleMinRelativeY = 0;
                bool maxIsBelow0 = (thisSamplePower.maxValue < 0);
                bool minIsBelow0 = (thisSamplePower.minValue < 0);
                unsigned int maxAbsValue = maxIsBelow0?(-thisSamplePower.maxValue):thisSamplePower.maxValue;
                unsigned int minAbsValue = minIsBelow0?(-thisSamplePower.minValue):thisSamplePower.minValue;
                thisSampleMaxRelativeY = (static_cast<unsigned int>(maxAbsValue) * static_cast<unsigned long int>(height) / static_cast<unsigned int>(maxPower - minPower));
                thisSampleMinRelativeY = (static_cast<unsigned int>(minAbsValue) * static_cast<unsigned long int>(height) / static_cast<unsigned int>(maxPower - minPower));
                uint16_t thisSampleTopAbsoluteY = 0;
                uint16_t thisSampleBottomAbsoluteY = 0;
                if (maxIsBelow0)
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY + thisSampleMaxRelativeY;
                else
                    thisSampleTopAbsoluteY = zeroSampleAbsoluteY - thisSampleMaxRelativeY;
                if (minIsBelow0)
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY + thisSampleMinRelativeY;
                else
                    thisSampleBottomAbsoluteY = zeroSampleAbsoluteY - thisSampleMinRelativeY;
                
                if (thisSampleTopAbsoluteY > thisSampleBottomAbsoluteY) {   /* Failsafe, should not occur */
                    std::swap(thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY);
                }
                if (debugYtop == UINT16_MAX) debugYtop = thisSampleTopAbsoluteY;
                if (debugYbottom == UINT16_MAX) debugYbottom = thisSampleBottomAbsoluteY;
                lcd.drawVerticalLine(thisSampleAbsoluteX, thisSampleTopAbsoluteY, thisSampleBottomAbsoluteY-thisSampleTopAbsoluteY, Stm32LcdDriver::DarkGreen, Stm32LcdDriver::Green, 5);
            }
        }
    }

    auto get_font24_ptr = [](const char c) {
        unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
        return &(Font24.table[(c-' ') * bytesPerGlyph]);
    };

    lcd.drawHorizontalLine(x, zeroSampleAbsoluteY, width, Stm32LcdDriver::Black); /* Draw 0 */
    uint16_t gridY;
    uint16_t gridWidth = nbHistoryEntries;
    uint16_t gridX = width - gridWidth;
    gridY = y + static_cast<uint16_t>(static_cast<unsigned long int>(maxPower - 3000) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
    lcd.drawHorizontalLine(gridX, gridY, gridWidth, Stm32LcdDriver::Grey, Stm32LcdDriver::Transparent, 2); /* Draw +3000W) */
    gridY = y + static_cast<uint16_t>(static_cast<unsigned long int>(maxPower - 2000) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
    lcd.drawHorizontalLine(gridX, gridY, gridWidth, Stm32LcdDriver::Grey, Stm32LcdDriver::Transparent, 2); /* Draw +2000W */
    if (gridWidth > 24*5 + 10) /* Enough room to draw 2000W label (5 chars). Draw above the line (substracting text height from y) */
        lcd.drawText(gridX + 2, gridY - 22, "2000W", Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::Black, Stm32LcdDriver::LCD_Color::Transparent);
    gridY = y + static_cast<uint16_t>(static_cast<unsigned long int>(maxPower - 1000) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
    lcd.drawHorizontalLine(gridX, gridY, gridWidth, Stm32LcdDriver::Grey, Stm32LcdDriver::Transparent, 2); /* Draw +1000W */
    if (gridWidth > 24*5 + 10) /* Enough room to draw 1000W label (5 chars). Draw above the line (substracting text height from y) */
        lcd.drawText(gridX + 2, gridY - 22, "1000W", Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::Black, Stm32LcdDriver::LCD_Color::Transparent);
    gridY = y + static_cast<uint16_t>(static_cast<unsigned long int>(maxPower + 1000) * static_cast<unsigned long int>(height) / static_cast<unsigned long int>(maxPower - minPower));
    lcd.drawHorizontalLine(gridX, gridY, gridWidth, Stm32LcdDriver::Grey, Stm32LcdDriver::Transparent, 2); /* Draw -1000W */

    debugValue = nbHistoryEntries * 4 / history.getPowerRecordsPerHour();
    for (unsigned int quarter = 1; quarter <= nbHistoryEntries * 4 / history.getPowerRecordsPerHour(); quarter++) {
        uint16_t gridX = width;
        if (gridX >= history.getPowerRecordsPerHour() * quarter / 4) {
            gridX -= history.getPowerRecordsPerHour() * quarter / 4;
            if (quarter % 4 == 0)  /* One hour */
                lcd.drawVerticalLine(gridX, y, height, Stm32LcdDriver::Black); /* Draw each hour */
            else
                lcd.drawVerticalLine(gridX, y, height, Stm32LcdDriver::Grey, Stm32LcdDriver::Transparent, 2); /* Draw each other quarter */
        }
    }

    /* FIXME: for debug only - start */
    uint8_t pos = 0;
    char statusLine[]="DH=@@@@ X=@@@ Yt=@@@ Yb=@@@ Dbg=@@@@@ P=@@@@@@";
    pos+=3; // "DH="
    statusLine[pos++]=(nbHistoryEntries / 1000) % 10 + '0';
    statusLine[pos++]=(nbHistoryEntries / 100) % 10 + '0';
    statusLine[pos++]=(nbHistoryEntries / 10) % 10 + '0';
    statusLine[pos++]=(nbHistoryEntries / 1) % 10 + '0';
    pos++;

