lains/stm32-linky-display/src/main.cpp
    pos+=2;
    statusLine[pos++]=(debugX / 100) % 10 + '0';
    statusLine[pos++]=(debugX / 10) % 10 + '0';
    statusLine[pos++]=(debugX / 1) % 10 + '0';
    pos++;

    pos+=3;
    if (debugYtop < 1000) {
        statusLine[pos++]=(debugYtop / 100) % 10 + '0';
        statusLine[pos++]=(debugYtop / 10) % 10 + '0';
        statusLine[pos++]=(debugYtop / 1) % 10 + '0';
    }
    else if (debugYtop == UINT16_MAX) {
        statusLine[pos++]='!';
        statusLine[pos++]='!';
        statusLine[pos++]='!';
    }
    else
        pos+=3;
    pos++;

    pos+=3;
    if (debugYbottom < 1000) {
        statusLine[pos++]=(debugYbottom / 100) % 10 + '0';
        statusLine[pos++]=(debugYbottom / 10) % 10 + '0';
        statusLine[pos++]=(debugYbottom / 1) % 10 + '0';
    }
    else if (debugYbottom == UINT16_MAX) {
        statusLine[pos++]='!';
        statusLine[pos++]='!';
        statusLine[pos++]='!';
    }
    else
        pos+=3;
    pos++;

    pos+=4;
    if (debugValue != INT_MIN) {
        if (debugValue < 0) {
            statusLine[pos++]='-';
            debugValue = -debugValue;
        }
        else
            statusLine[pos++]=' ';
        statusLine[pos++]=(debugValue / 1000) % 10 + '0';
        statusLine[pos++]=(debugValue / 100) % 10 + '0';
        statusLine[pos++]=(debugValue / 10) % 10 + '0';
        statusLine[pos++]=(debugValue / 1) % 10 + '0';
    }
    pos++;

    pos+=2; // "P="
    if (debugMinPower != INT_MIN) {
        if (debugMinPower < -99999 || debugMinPower > 99999) {
            statusLine[pos++]='*'; /* Overflow/underflow */
        }
        else {
            if (debugMinPower < 0) {
                statusLine[pos++]='-';
                debugMinPower = -debugMinPower;
            }
            else
                statusLine[pos++]=' ';
        }
        statusLine[pos++]=(debugMinPower / 100000) % 10 + '0';
        statusLine[pos++]=(debugMinPower / 10000) % 10 + '0';
        statusLine[pos++]=(debugMinPower / 1000) % 10 + '0';
        statusLine[pos++]=(debugMinPower / 100) % 10 + '0';
        statusLine[pos++]=(debugMinPower / 10) % 10 + '0';
        statusLine[pos++]=(debugMinPower / 1) % 10 + '0';
    }
     
    lcd.drawText(0, 4*24, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);
    /* FIXME: end */
}

class Stm32DebugOutput {
public:
    Stm32DebugOutput() : inError(false) {
        this->handle.Instance = USART3;
        this->handle.Init.BaudRate = 57600;
        this->handle.Init.WordLength = UART_WORDLENGTH_8B;
        this->handle.Init.StopBits = UART_STOPBITS_1;
        this->handle.Init.Parity = UART_PARITY_NONE;
        this->handle.Init.Mode = UART_MODE_TX_RX;
        this->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;

        HAL_UART_DeInit(&(this->handle));
        if (HAL_UART_Init(&handle) != HAL_OK) {
            this->inError = true;
        }
    }

    bool send(const uint8_t* buffer, unsigned int len) {
        if (this->inError) return false;
        HAL_StatusTypeDef result = HAL_UART_Transmit(&(this->handle), (uint8_t*)buffer, len, 5000);
        if (result != HAL_OK)
            this->inError = true;
        return this->inError;
    }

    bool send(const char* text) {
        return this->send(reinterpret_cast<const uint8_t*>(text), strlen(text));
    }

    bool inError;
    UART_HandleTypeDef handle;
};

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32F4xx HAL library initialization:
      - Configure the Flash prefetch, instruction and Data caches
      - Systick timer is configured by default as source of time base, but user 
        can eventually implement his proper time base source (a general purpose 
        timer for example or other time source), keeping in mind that Time base 
        duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and 
        handled in milliseconds basis.
      - Set NVIC Group Priority to 4
      - Low Level Initialization: global MSP (MCU Support Package) initialization
    */
    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure LED1, LED2, LED3 and LED4 */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Init(LED3);
    BSP_LED_Init(LED4);
    BSP_LED_On(LED2);
    waitDelay(250);
    BSP_LED_Off(LED2);

    /* Initialize the SDRAM */
    BSP_SDRAM_Init();
    //BSP_SD_Init();

    Stm32DebugOutput debugSerial;

    Stm32SerialDriver& ticSerial = Stm32SerialDriver::get();

    ticSerial.start();

    Stm32LcdDriver& lcd = Stm32LcdDriver::get();

    //BSP_TS_Init(800,480);
    /* Initialize the LCD */
    OnError_Handler(!lcd.start());

    PowerHistory powerHistory(PowerHistory::Per5Seconds);

    TicFrameParser ticParser(PowerHistory::unWrapOnNewPowerData, (void *)(&powerHistory));

    TIC::Unframer ticUnframer(TicFrameParser::unwrapInvokeOnFrameNewBytes,
                              TicFrameParser::unwrapInvokeOnFrameComplete,
                              (void *)(&ticParser));

    TicProcessingContext ticContext(ticSerial, ticUnframer);

    powerHistory.setContext(&ticContext);

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    auto streamTicRxBytesToUnframer = [](void* context) { }; /* Discard any TIC data */
#else
    auto streamTicRxBytesToUnframer = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        uint8_t streamedBytesBuffer[256];  /* We allow copies of max 256 bytes at a time */
        size_t incomingBytesCount = ticContext->ticSerial.read(streamedBytesBuffer, sizeof(streamedBytesBuffer));
        std::size_t processedBytesCount = ticContext->ticUnframer.pushBytes(streamedBytesBuffer, incomingBytesCount);
        if (processedBytesCount < incomingBytesCount) {
            size_t lostBytesCount = incomingBytesCount - processedBytesCount;
            if (lostBytesCount > static_cast<unsigned int>(-1)) {
                lostBytesCount = static_cast<unsigned int>(-1); /* Does not fit in an unsigned int! */
            }
            if (static_cast<unsigned int>(-1) - lostBytesCount < ticContext->lostTicBytes) {
                /* Adding lostBytesCount will imply an overflow an overflow of our counter */
                ticContext->lostTicBytes = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
            }
            else {
                ticContext->lostTicBytes += lostBytesCount;
            }
        }
        unsigned int serialRxOverflowCount = ticContext->ticSerial.getRxOverflowCount(true);
        if (static_cast<unsigned int>(-1) - serialRxOverflowCount < ticContext->serialRxOverflowCount) {
            /* Adding serialRxOverflowBytes will imply an overflow of our counter */
            ticContext->serialRxOverflowCount = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
        }
        else {
            ticContext->serialRxOverflowCount += serialRxOverflowCount;
        }
    };
#endif
    auto isNoNewPowerReceivedSinceLastDisplay = [](void* context) -> bool {
        if (context == nullptr)
            return true;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        return (ticContext->lastParsedFrameNb == ticContext->lastDisplayedPowerFrameNb);
    };

